#### FabricationDimensionUnitType Enumeration

---

|  |
| --- |
| See Also |

Fabrication dimension unit type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum FabricationDimensionUnitType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FabricationDimensionUnitType ``` |

| Visual C++ |
| --- |
| ``` public enum class FabricationDimensionUnitType ``` |

# Members

| Member name | Description |
| --- | --- |
| NoUnits | NoUnits. |
| Linear | Linear. |
| Angular | Angular. |

# See Also

Autodesk.Revit.DB Namespace